Config/DataProcessors/ПомощникКорректировкиУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникКорректировкиУчетаОС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/Enums/ВидыНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НПА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПраваПользованияИмуществом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/DataProcessors/ПомощникКорректировкиУчетаОС/Forms/ФормаВидТипНФА/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Период", Период);
	
	АдресДанных = Параметры["АдресДанных"];
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);

	СписокОС.Загрузить(Данные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОшибки(Команда)
	
	ЗаполнитьОшибкиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьОшибки(Команда)
	
	БезОшибок = Истина;
	Шаблон = НСтр("ru = 'Стр. %1. Новый вид НФА не заполнен.'");
	
	Для Каждого СтрокаТаблицы Из СписокОС Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ВидНФАНовый) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(Шаблон, СтрокаТаблицы.НомерСтроки));
		КонецЕсли;
	КонецЦикла;
	
	Если БезОшибок Тогда
		ИсправитьОшибкиСервер();
		ТекстСообщения = НСтр("ru = 'Исправление завершено. Перазаполните таблицу чтобы увидеть актуальные значения.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	// Цвет недоступных для редактирования колонок
	// (сделано через условное оформление, т.к. не меняется цвет разделительных линий и шапки таблицы)
	Элемент = УсловноеОформление.Элементы.Добавить();	
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(Элемент.Поля, "СписокОСТипНФАНовый");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"СписокОС.ВидНФАНовый", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.ВидыНФА.ОС);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "-");
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", "Истина");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОшибкиСервер()
	
	Данные = Обработки.ПомощникКорректировкиУчетаОС.ТаблицаДанныхВидТипНФА(Организация, Период);
	
	СписокОС.Загрузить(Данные);
	
КонецПроцедуры

&НаСервере
Процедура ИсправитьОшибкиСервер()
	
	ШаблонОшибки = НСтр("ru = 'Стр. %1. Не удалось обработать основное средство: ""%2"" по причине: %3'");
	
	Для Каждого СтрокаТаблицы Из СписокОС Цикл
		
		ТипНФАНовый = ?(СтрокаТаблицы.ВидНФАНовый = Перечисления.ВидыНФА.ОС,
			СтрокаТаблицы.ТипНФАНовый, Перечисления.ТипыНФА.ПустаяСсылка());
		
		Если СтрокаТаблицы.ВидНФАНовый = СтрокаТаблицы.ВидНФА И ТипНФАНовый = СтрокаТаблицы.ТипНФА Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			НачатьТранзакцию();
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ОсновныеСредства");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.ОсновноеСредство);
			Блокировка.Заблокировать();
			
			ОбъектОС = СтрокаТаблицы.ОсновноеСредство.ПолучитьОбъект();
			
			ОбъектОС.ВидНФА = СтрокаТаблицы.ВидНФАНовый;			
			ОбъектОС.ТипНФА = ТипНФАНовый;
				
			ОбъектОС.ОбменДанными.Загрузка = Истина;
			ОбъектОС.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтрШаблон(ШаблонОшибки, СтрокаТаблицы.НомерСтроки, 
				СтрокаТаблицы.ОсновноеСредство, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СтрокаТаблицы.ОсновноеСредство);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
